{"content":{"out":{"attributes":{"title":"Welcome to my Blog!!","date":"2021-01-12"},"body":"<p>I finally got around setting up the blog using Github and jekyll. My older blog was made using jekyll now which is the most straightforward way of creating a blog in this world hand down. One tip if you are planning to create your own blogs using jekyl (I learned this the hard way i.e by wasting an entire day) is while the official documentation is good and understandable, it&#39;s faster to just find a theme and make changes to it. I knew there were themes we could choose from (because there is an entire section on that website about it), but I figured that I needed to learn jekyll first before I could use those themes (I was so wrong). Later I found out that themes were the easiest and the most popular aspect of jekyll. I searched online and found something that I liked and if you are reading this, this is the theme. Later I also found an article on how to create a blog like &#39;this&#39; using jekyll(<a href='https://medium.com/@jashmehta3300/how-to-make-a-blog-using-hyde-jekyll-and-host-it-on-github-pages-42123c239b8' target='_blank'>this</a>). \n<br>\nSo what will you get from these blogs? I would have liked to say that you will\nget a weekly dose of tech related stuffs, but that would be straightup lying. I\nwill be posting about stuffs I make, these things won&#39;t be anything grand or\nnever seen before stuffs, but they will be something I like to do. This blog is\nan account of what I like, or what I find interesting. Yeah so if you like\nsloppy english and sloppy codes, you will get both things here. Also you can\ncheck out my website <a href=\"https://arogyad.herokuapp.com/\" target=\"_blank\"> here\n</a>. Some things may not work in the website, I am sorry about that. I am\nsaving to rent a webhost, so yeah when I do that I will let you know. Also I\nlike cricket and old classical guitar music (cliché?), but I won&#39;t be making\nblog about those as I am not really good at both of those things. So yeah this\nis my first blog, hope to see you on the next one.</p>\n","bodyBegin":5,"frontmatter":"title: Welcome to my Blog!!\ndate: 2021-01-12"},"next":{"link":"2021-01-27-some_way_of_doing_maths","blog":{"date":"2021-01-27","title":"Some way of doing Maths"}}}}