{"content":{"out":{"attributes":{"title":"Some way of doing Maths","date":"2021-01-27"},"body":"<p>I had this idea of making a program of some sort that would solve your mathematical problems on the fly. I came up with this idea because of this GitHub repo <a href=\"https://github.com/vdoubleu/Math-Equation-Solver\">https://github.com/vdoubleu/Math-Equation-Solver</a>. The author of this repo had made a web app that accepts a .jpg or .png file and solves the mathematical problem. I wanted to do something of this sort but with my twist so I made this web app which has a small canvas on the center of the screen where you preferably draw mathematical operations, however you can draw anything but it won&#39;t do anything, and the app tries it&#39;s best to recognize the mathematical operations and solve the problem. The backend is written in python, flask as the micro-web framework, and fastai as the deep learning framework. The frontend is written javascript, which was tough cause I didn&#39;t have any exposure to javascript before this project. The entire implementation can be found on my GitHub or at <a href=\"https://github.com/arogydhl/HandwrittenEquationSolverWebApp\">https://github.com/arogydhl/HandwrittenEquationSolverWebApp</a>. This blog is just an introduction to the project and in future blogs, I will explain more about the frontend and the backend.</p>\n<h2 id=\"the-frontend\">The Frontend:</h2>\n<p>Okay, let&#39;s talk about the frontend which is far from being called attractive but I am proud of javascript for holding to such sloppy programming. The drawing canvas where you draw the mathematical operations is a &#39;canvas&#39; element (surprised?). In layman&#39;s terms, the canvas records the movement of the mouse, converts it into an image then sends it to the backend for processing. The javascript for this project is a mess, it isn&#39;t written following the best practices but it does the work, so yeah I am not really going to change it (or maybe I will I don&#39;t really know). However, the one thing I really want to change is the way the website looks, it looks really dull. I don&#39;t know much CSS, so it will take me a while to push a new version with better aesthetics.</p>\n<h2 id=\"the-backend\">The Backend:</h2>\n<p>The backend is written entirely in python using flask as the micro-web framework. I found out about flask when I was searching for easy ways of making dynamic websites. I had this other alternative as well, Django, but it seemed really intimidating. So the backend accepts the image as a base64 encoded bytes and returns decoded bytes, which in this case is an image. The benefit of this method is that the image doesn&#39;t need to be saved in drive and can be sent without any intermediate saving and loading, which would have made the program slow. These decoded bytes are then sent to the classification model. The model identifies the mathematical operations and numbers, then a list containing all these operations is sent to the math_lib which performs the mathematical operations.</p>\n<h2 id=\"things-i-have-to-change\">Things I have to change:</h2>\n<p>The first thing that I have to change, which I have already pointed out, is the aesthetic of the website. I also want to add more mathematical operations such as derivative and trigonometric functionality. The integration function calculates the integration between 0 and 1, which isn&#39;t that interesting unless you want to calculate the integration of a function between 0 and 1. I also have the task of making the javascript more readable as sometimes it is difficult even for me to read my own codes.</p>\n<h2 id=\"things-i-used\">Things I used:</h2>\n<ol>\n<li><p>The dataset can be found at <a href=\"https://www.kaggle.com/xainano/handwrittenmathsymbols\">https://www.kaggle.com/xainano/handwrittenmathsymbols</a>. This is an excellent dataset if you are planning to do some computer vision task incorporating mathematics.</p>\n</li>\n<li><p>Fastai as the major deep learning model, the transfer learning functionality provided by fastai makes it one of the most beautiful libraries.</p>\n</li>\n<li><p>Flask as the micro-web framework, however, I am planning to learn Django and transfer this model to Django.</p>\n</li>\n</ol>\n<p>You can contact me at my email address provided in the <a href=\"https://arogydhl.github.io/about/\">About</a> section. The next blog will be about the frontend of the project.</p>\n","bodyBegin":6,"frontmatter":"title: Some way of doing Maths\ndate: 2021-01-27"},"prev":{"link":"2021-01-12-welcome_to_my_blog","blog":{"date":"2021-01-12","title":"Welcome to my blog!"}},"next":{"link":"2021-02-02-frontend_explanation","blog":{"date":"2021-02-02","title":"Frontend Explanation"}}}}