{"content":{"out":{"attributes":{"title":"Simplest Library Management System","date":"2021-02-26"},"body":"<p>I have always wanted to learn JavaScript and some of its libraries, the more mainstream ones, like <a href='https://www.electronjs.org/' target='_blank'>electronjs</a>,<a href='https://v3.vuejs.org/' target='_blank'> vue </a> etc. So last week I gave it a try, I originally had the idea to just read the docs and understand about them, but I get distracted easily and I find reading a little boring. So like most youtube videos on teaching programming would suggest you, I tried making a library management system. This project was a learning process, which was made super simple by the great documentation provided on electronjs&#39;s website. I didn&#39;t use vue because I find vanilla JavaScript cute ( I hope this doesn&#39;t sound weird ) plus this was a super simple project and I didn&#39;t want to complicate it. Electron also makes it simple to package and distribute your projects, but I haven&#39;t checked that out.</p>\n<p>The system does only the basic stuff like keeping the record of books, students who have borrowed books, and some other things. This project was a learning experience thus not all of the things work properly but I am happy that I know a little more about JavaScript. I would love to study more JavaScript, getting more familiar with JavaScript and its mainstream libraries sounds very cool. I had always looked at JavaScript like that character in a movie who is there just to add personality to the protagonist, but even though I have learned only a small amount of JavaScript it seems like it is the main deal. The abilities of JavaScript seem endless ( I don&#39;t know how good it is for AI though), it is fast and flexible. I almost forgot to link the GitHub repo, <a href='https://github.com/arogyad/simplelibrarymgmtsystem' target='_blank'> here </a> it is. Next up something regarding alphabets,hopefully.</p>\n","bodyBegin":5,"frontmatter":"title: Simplest Library Management System\ndate: 2021-02-26"},"prev":{"link":"2021-02-15-segmentation_model","blog":{"date":"2021-02-15","title":"Segmentation Model"}},"next":{"link":"2021-06-08-rust_bust","blog":{"date":"2021-06-08","title":"Rust Bust"}}}}